app/views/devise/registrations/new.html.erb

SELECT `Role_Name`, `roles`.`id` FROM `roles`
---
    <%= f.label :roles,as: 'Role_Name' %><br/>
    <%= f.select :role_ids,Role.pluck(:Role_Name,:id),{include_blank: "Select Type",required:true } %>