app/controllers/application_controller.rb

 def after_sign_in_path_for(resource)
    role = Role.find_by(role_name: params[:user][:roles])
    current_user.roles << role if role !=nil

    if current_user.roles.first.role_name == 'Customer'
        return all_properties_path
    elsif current_user.roles.first.role_name== 'Property Owner'
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`role_name` = 'Customer' LIMIT 1
SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 24 ORDER BY `roles`.`id` ASC LIMIT 1
SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 19 ORDER BY `roles`.`id` ASC LIMIT 1