app/controllers/bookings_controller.rb

  def index
    @bookings = Booking.all
---
SELECT `bookings`.* FROM `bookings`

  def create
    @booking = Booking.new(booking_params)
    @booking.user_id = current_user.id
    # @booking._id = current_user.id



    respond_to do |format|
      if @booking.save
---
INSERT INTO `bookings` (`price`, `start_date`, `end_date`, `status`, `created_at`, `updated_at`, `user_id`, `property_id`) VALUES (NULL, '2022-09-02', '2022-09-16', FALSE, '2022-09-01 09:26:59.453016', '2022-09-01 09:26:59.453016', 25, 8)

  def destroy
    @booking.destroy
---
DELETE FROM `bookings` WHERE `bookings`.`id` = 1

    def set_booking
      @booking = Booking.find(params[:id])
---
SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`id` = 1 LIMIT 1