app/controllers/properties_controller.rb

SELECT `properties`.* FROM `properties` WHERE `properties`.`user_id` = 17
---
  def index
    @properties = current_user.properties.all

SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 1 LIMIT 1
---
  def all_bookings
    @property = Property.find(params[:id])

SELECT `properties`.* FROM `properties`
---
  def all_property

  @properties = Property.all

INSERT INTO `properties` (`name`, `address`, `latitude`, `longitude`, `user_id`, `created_at`, `updated_at`, `price`) VALUES ('Lucknow12', 'lko', '12.34', '65.34', 28, '2022-08-25 17:21:06.820408', '2022-08-25 17:21:06.820408', 950)
---
  def create
    @property = Property.new(property_params)
    @property.user_id = current_user.id

    respond_to do |format|
      if @property.save

SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 1 LIMIT 1
---
    def set_property
      @property = Property.find(params[:id])